<template>
  <div>
    <div class="page-heading">
      <div class="page-title">
        <div class="row">
          <div class="col-12 col-md-6 order-md-1 order-last">
            <h3>{{ __("customers_list") }}</h3>
          </div>
          <div class="col-12 col-md-6 order-md-2 order-first">
            <nav
              aria-label="breadcrumb"
              class="breadcrumb-header float-start float-lg-end"
            >
              <ol class="breadcrumb">
                <li class="breadcrumb-item">
                  <router-link to="/dashboard">{{ __("dashboard") }}</router-link>
                </li>
                <li class="breadcrumb-item active" aria-current="page">
                  {{ __("customers_list") }}
                </li>
              </ol>
            </nav>
          </div>
        </div>
      </div>
      <section class="section">
        <div class="card">
          <div class="card-header">
            <h4 class="card-title">{{ __("customers") }}</h4>
          </div>
          <div class="card-body">
            <b-row class="mb-2">
              <b-col md="3" offset-md="8">
                <h6 class="box-title">{{ __("search") }}</h6>
                <b-form-input
                  id="filter-input"
                  v-model="filter"
                  type="search"
                  :placeholder="__('search')"
                  @click="addFilter()"
                ></b-form-input>
              </b-col>
              <b-col md="1" class="text-center">
                <button
                  class="btn btn-primary btn_refresh"
                  v-b-tooltip.hover
                  :title="__('refresh')"
                  @click="getCustomers()"
                >
                  <i class="fa fa-refresh" aria-hidden="true"></i>
                </button>
              </b-col>
            </b-row>
            <div class="table-responsive">
              <b-table
                :items="customers"
                :fields="fields"
                :current-page="currentPage"
                :per-page="perPage"
                :filter="filter"
                :filter-included-fields="filterOn"
                :sort-by.sync="sortBy"
                :sort-desc.sync="sortDesc"
                :sort-direction="sortDirection"
                :bordered="true"
                :busy="isLoading"
                stacked="md"
                show-empty
                small
              >
                <template #table-busy>
                  <div class="text-center text-black my-2">
                    <b-spinner class="align-middle"></b-spinner>
                    <strong>{{ __("loading") }}...</strong>
                  </div>
                </template>

                <template #cell(email)="row">
                  {{ row.item.email | emailMask }}
                </template>

                <template #cell(mobile)="row">
                  {{ row.item.mobile | mobileMask }}
                </template>

                <template #cell(type)="row">
                  <img
                    :src="$baseUrl + '/images/phone.svg'"
                    height="40"
                    alt="phone"
                    v-if="row.item.type == 'phone'"
                  />
                  <img
                    :src="$baseUrl + '/images/google.svg'"
                    height="40"
                    alt="google"
                    v-if="row.item.type == 'google'"
                  />
                  <img
                    :src="$baseUrl + '/images/apple.svg'"
                    height="40"
                    alt="apple"
                    v-if="row.item.type == 'apple'"
                  />
                </template>

                <template #cell(status)="row">
                  <span v-if="row.item.status == 1" class="badge bg-success">{{
                    __("active")
                  }}</span>
                  <span v-else class="badge bg-danger">{{ __("deactive") }}</span>
                </template>

                <template #cell(created_at)="row">
                  {{ new Date(row.item.created_at).toLocaleString() }}
                </template>
                <template #cell(actions)="row">
                  <a
                    class="btn btn-sm"
                    @click="updateStatusCustomer(row.index, row.item.id)"
                  >
                    <span class="primary-toggal" v-if="row.item.status == 1"
                      ><i class="fa fa-toggle-on fa-2x"></i
                    ></span>
                    <span class="text-danger" v-else
                      ><i class="fa fa-toggle-off fa-2x"></i
                    ></span>
                  </a>
                </template>
              </b-table>
            </div>
            <b-row>
              <b-col md="2" class="my-1">
                <label>
                  <b-form-group
                    :label="__('per_page')"
                    label-for="per-page-select"
                    label-align-sm="right"
                    label-size="sm"
                    class="mb-0"
                  >
                    <b-form-select
                      id="per-page-select"
                      v-model="perPage"
                      @change="addFilter"
                      :options="pageOptions"
                      size="sm"
                      class="form-control form-select"
                    ></b-form-select>
                  </b-form-group>
                </label>
              </b-col>
              <b-col md="4" class="my-1" offset-md="6">
                <label>{{ __("total_records") }}:- {{ totalRows }}</label>
                <b-pagination
                  v-model="currentPage"
                  :total-rows="totalRows"
                  :per-page="perPage"
                  align="fill"
                  size="sm"
                  class="my-0"
                ></b-pagination>
              </b-col>
            </b-row>
          </div>
        </div>
      </section>
    </div>
  </div>
</template>
<script>
export default {
  data: function () {
    return {
      isLoading: false,
      fields: [
        { key: "name", label: __("name"), sortable: true, class: "text-center" },
        { key: "phone", label: __("mobile_no"), sortable: true, class: "text-center" },
      ],
      totalRows: 1,
      currentPage: 1,
      perPage: this.$perPage,
      pageOptions: this.$pageOptions,

      sortBy: "id",
      sortDesc: true,
      sortDirection: "desc",
      filter: null,
      filterOn: [],
      customers: [
        { name: "مطبخ الشريف", phone: "966505577348" },
        { name: "مطبخ مائدة القصر", phone: "540003373" },
        { name: "شركة المضيف المتميز", phone: "966505501559" },
        { name: "هلا الحجاز", phone: "966565554407" },
        { name: "مطعم ريتاج لخدمات الاعاشة", phone: "966503552516" },
        { name: "أذواق الحجاز", phone: "966555529459" },
        { name: "عالم الأطعمة", phone: "966555531591" },
        { name: "مطابخ وبوفيهات طعام البردوني", phone: "966555546436" },
        { name: "مطابخ السعودية للتموين والإعاشة", phone: "966505509553" },
        { name: "مطبخ النور", phone: "966500182833" },
        { name: "وسام المروج لخدمات التغذية والإعاشة", phone: "966555657577" },
        { name: "مطبخ سدر لتقديم الوجبات", phone: "966553553790" },
        { name: "مطابخ الشعلة لخدمات الاعاشة", phone: "966547077048" },
        { name: "مصنع حلويات شركة القصور للحفلات والتموين", phone: "966505507963" },
        { name: "مطبخ المتميزون الإعاشة والتغذية", phone: "966555896630" },
        { name: "مطبخ قلوب الإ خوان لتقديم الوجبات", phone: "966566637763" },
        { name: "شركة هليون لخدمات الاعاشة", phone: "966505607749" },
        { name: "مؤسسة كرم كمال للإعاشة", phone: "966555598097" },
        { name: "مؤسسة مكرم لخدمات الاعاشة", phone: "966540008514" },
        { name: "مطبخ ضيوف الشرق", phone: "966569559965" },
        { name: "مطاعم ومطابخ كنوز", phone: "966556513531" },
        { name: "مؤسسة بستان الطهاة لخدمات الاعاشة", phone: "966555072765" },
        { name: "شركة طهاة البلد لخدمات الاعاشة", phone: "966560050042" },
        { name: "مطبخ شركة أحلى زاد للإعاشة", phone: "966555759514" },
        { name: "مطابخ ومطاعم الضيافة الراقية لخدمات الإعاشة", phone: "966504503801" },
        { name: "مطعم ومطبخ رغائب", phone: "966506505070" },
        { name: "شركة عبدالله محمد فتحي ابوالجدائل للتموين 1", phone: "966562006000" },
        { name: "شركة عبدالله محمد فتحي ابوالجدائل للتموين 1", phone: "966562006000" },
        { name: "مطابخ السعادة بوفيهات حفلات تموين اعاشة", phone: "966504521898" },
        { name: "مطبخ خير المشاعر", phone: "966581818168" },
        { name: "شركة مجموعة خدمات الطعام", phone: "966504604545" },
        {
          name: "شركــــة سمــا رامـــا الذهبيـــــــــة المحـــدود",
          phone: "966504777263",
        },
        { name: "مطابخ منى للإعاشة والتموين", phone: "966567750002" },
        { name: "ارض الجمان للاعاشة", phone: "966505501084" },
        { name: "مطبخ اعاشة الأحمدي للتموين", phone: "966598596633" },
        { name: "مؤسسة فود ارت لخدمات الإعاشة", phone: "966566204581" },
        { name: "دالين المتميزة لخدمات الاعاشة", phone: "966568000509" },
        { name: "شركة أطعمة الشرق الأوسط", phone: "966508738789" },
        { name: "نبراس المذاق لخدمات الإعاشة", phone: "966560009993" },
        { name: "مطبخ المزروعي لخدمات الإعاشة", phone: "966555066460" },
        { name: "مطبخ الزمرد لخدمات الاعاشة", phone: "966554788099" },
        { name: "شركة اسرار الغربية لخدمات الاعاشة", phone: "966580112039" },
        { name: "شركة ماس المطورة لخدمات الاعاشة", phone: "966505538090" },
        { name: "مطبخ سما الضيافة", phone: "966593338226" },
        { name: "مطبخ ومطعم الدار اليضاء للامداد والتموين", phone: "966545882221" },
        { name: "اذواق عالميــــــــة", phone: "966555045047" },
        { name: "مطابخ أنفال قريش", phone: "966555540789" },
        { name: "مطابخ مناسبات حجازية", phone: "966556173311" },
        { name: "افرند العربية الاعاشة", phone: "966505555898" },
        { name: "مطبخ عرفات", phone: "966555516875" },
        { name: "مطبخ عبدالله الحربي للإعاشة", phone: "966555537420" },
        { name: "مطبــــخ أطيـــــاف الحديثه", phone: "966566660229" },
        { name: "شركه نمور الاطعمه المحدوده", phone: "966581185313" },
        { name: "مؤسسة نبيل عبدالله للإعاشة والتموين", phone: "966505603843" },
        { name: "صفوة الوسام", phone: "966561233338" },
        { name: "مطبخ المذاق التركي", phone: "966555510370" },
        { name: "شركة هوم افريكانا لخدمات الاعاشة", phone: "966530031772" },
        { name: "مطبخ الضيافة", phone: "966560800039" },
        { name: "شركة تغذية المتطورة المحدودة تادكو", phone: "966597192257" },
        { name: "الافندي للاعاشة والحفلات الخارجية", phone: "966556565514" },
        { name: "مطابخ رونق الجوهرة", phone: "966568666188" },
        { name: "مطبخ رواد مكة", phone: "966545155151" },
        { name: "مطبخ المحجوب للأعاشة", phone: "966544901833" },
        { name: "مذاق النبلاء لخدمات الاعاشة", phone: "555586680" },
        { name: "الياسمين", phone: "966555501298" },
        { name: "مؤسسة حنان للاعاشة", phone: "966598102972" },
        { name: "الكرم المميز لخدمات الاعاشة", phone: "966563303305" },
        { name: "شركة حسام المعالي", phone: "966545710040" },
        { name: "مطبخ باريك لتامين الاعاشة", phone: "966555521633" },
        { name: "مؤسسة الشريعة لخدمات الاعاشة والتموين", phone: "966555502337" },
        { name: "شركة فاطمة فؤاد مرتع لخدمات الاعاشة", phone: "966505645841" },
        { name: "مطبخ طاهي الحجاز للإعاشة و التموين", phone: "966595058121" },
        { name: "مطابخ العليان للإعاشة", phone: "966550244406" },
        { name: "مطاعم ومطابخ شركة الفارس السريع للإعاشة", phone: "966561111137" },
        { name: "مطبخ آسيان للتغذية", phone: "966504501343" },
        { name: "مطبخ الملتزم", phone: "581445999" },
        { name: "الكنانة للتموين", phone: "966554433962" },
        { name: "مؤسسة رواد الزاد لخدمات الاعاشة", phone: "966504548473" },
        { name: "الزاد الحجازي", phone: "966555504043" },
        { name: "شركة ندى الطموح للإعاشة", phone: "966567964990" },
        { name: "شركة انعام للتجارة وتامين الاعاشة", phone: "966592908542" },
        { name: "ادامة الرؤيا للاعاشة", phone: "966502836854" },
        { name: "مطعم ومطبخ جوهرة آسيا", phone: "966505505446" },
        { name: "مطبخ روائع الطبخ لخدمات الاعاشه", phone: "966555563978" },
        { name: "سفراء التميز", phone: "590994825" },
        { name: "مطبخ بناء العالمية لخدمات الاعاشة", phone: "966541641868" },
        { name: "شركة محمود محمد حرسي لخدمات الاعاشة والمطاعم", phone: "966539999561" },
        { name: "الافندية", phone: "966549007995" },
        { name: "التغذية الراقية لخدمات الاعاشة", phone: "544328537" },
        { name: "اكناف المذاق", phone: "966555534390" },
        { name: "بركة التجهيزات للإعاشة", phone: "966553592000" },
        { name: "مطبخ مذاق الوادي للإعاشة", phone: "966560724507" },
        { name: "مواسم الخيرات للإعاشة", phone: "966555685804" },
        { name: "مطبخ الريان الماسي", phone: "966506076975" },
        { name: "أطايب مذاق الأخيار لخدمات الاعاشة", phone: "966568888182" },
        { name: "مؤسسة التغذية الدولية لخدمات الاعاشة", phone: "554499677" },
        { name: "شركة صدف الشرق لخدمات الاعاشة", phone: "966505882873" },
        { name: "شركة وائل رشيدي لخدمات الاعاشة", phone: "966597799233" },
        { name: "شركة يونيك المحدودة", phone: "966569132323" },
        { name: "مطبخ رسيل لاعاشة والتموين", phone: "966541256662" },
        { name: "شركة اتحاد الطهاة لخدمات الاعاشة", phone: "966555513054" },
        { name: "مطابخ خالد سلطان آل ملفي للإعاشة", phone: "966565859404" },
        { name: "الجاوي للتغذية والاعاشة", phone: "966545109595" },
        { name: "مطابخ الضيافة الحجازية", phone: "966543355002" },
        { name: "رؤية الفؤاد", phone: "966555509365" },
        { name: "مؤسسة أجزل الخير للإعاشة", phone: "966566494942" },
        { name: "مراسي المعمورة", phone: "966566202046" },
        { name: "شركة المروج لخدمات الاعاشة", phone: "966545817978" },
        { name: "مطابخ الطاهي", phone: "966556466771" },
        { name: "مطبخ جوهرة المنير لتقديم الوجبات", phone: "966531417911" },
        { name: "شركة الضيافة المرموقة للتموين", phone: "966555506579" },
        { name: "الوسام الفاخر", phone: "966566798283" },
        { name: "نجمة العليان للتموين", phone: "966533375015" },
        { name: "الطيبات لخدمات الإعاشة", phone: "966547068063" },
        { name: "الرواد لخدمات الاعاشة", phone: "966555568519" },
        { name: "مطبخ الملتقى", phone: "966544162446" },
        { name: "مطبخ الفارس المتميز", phone: "966501623502" },
        { name: "شركة دعم المواسم لخدمات الإعاشة", phone: "966549550174" },
        { name: "راية المتحدون", phone: "966557990762" },
        { name: "زاد الطائفين الاعاشة", phone: "966564396663" },
        { name: "مؤسسة أذواق القمة التجارية", phone: "966505574534" },
        { name: "الملبي لخدمات الإعاشة", phone: "966505147415" },
        { name: "مؤسسة مأكولات الشيف لخدمات الإعاشة", phone: "966500409936" },
        { name: "مطبخ الجوهرة", phone: "966566617919" },
        {
          name: "شركة مطاعم ومطابخ المضياف العربي لتقديم الوجبات",
          phone: "966555517437",
        },
        { name: "شركة بساتين البركة للاعاشة والتموين", phone: "966555571713" },
        { name: "شركة التموين للتغذية مطبخ إعاشة", phone: "966555767171" },
        { name: "مؤسسة الاسناد الماسي لخدمات الاعاشة", phone: "966532661924" },
        { name: "مؤسسة الطاهي العالمي لخدمات الإعاشة", phone: "966555591167" },
        { name: "شركة زاد المشاعر لخدمات الاعاشة", phone: "966500607502" },
        { name: "مطابخ مواسم الخير لتقديم الوجبات", phone: "966503554094" },
        { name: "شركة المكارم المتميزة لخدمات الاعاشة", phone: "966555530869" },
        { name: "شركة مطاعم اطلالة روابي الشام لخدمات الاعاشة", phone: "966563966690" },
        { name: "رحاب للاعاشة", phone: "966568100007" },
        { name: "شركة كنانة العربية المحدودة", phone: "966505508748" },
        { name: "البوابة الدمشقية", phone: "966556124340" },
        { name: "مطابخ رتيل", phone: "966563626066" },
        { name: "شركة سكاب العربية للمقاولات المعمارية المحدودة", phone: "966555586114" },
        { name: "درة الرافدين", phone: "966541640086" },
        { name: "مطبخ الياسمين 2", phone: "966502876370" },
        { name: "مطبخ طلوع الفجر لخدمات الاعاشة", phone: "966558585691" },
        { name: "شركة المائدة لخدمات الاعاشة", phone: "966599999105" },
        { name: "مؤسسة الامداد والتموين السعودي التجارية", phone: "966545958186" },
        {
          name: "مطابخ حمد بن حماد بن حمود العتيبي لتقديم الوجبات",
          phone: "966555564647",
        },
        { name: "مطبخ الطباخ الماهر لخدمات الإعاشة", phone: "966544533371" },
        { name: "سكب الحجاز للاعاشة والتموين", phone: "966555177334" },
        { name: "مطبخ المنقل", phone: "966555507703" },
        { name: "شركة الخيمة الذهبية لخدمات الاعاشة", phone: "966555123929" },
        { name: "مطبخ رفادة الحجاز لخدمات الاعاشة", phone: "966543795522" },
        { name: "مؤسسة شيف السعادة لخدمات الاعاشة", phone: "966542768255" },
        { name: "شركة سرهد", phone: "966567238819" },
        { name: "شركة نكهه عالية للإعاشة", phone: "966505555576" },
        { name: "مؤسسة الكيان المميز لخدمات الاعاشة", phone: "966566680500" },
        { name: "مطبخ مجاهد للاعاشة", phone: "966543277065" },
        { name: "مطابخ أنوار المحمدية الاعاشة والتموين", phone: "966503597746" },
        { name: "مطابخ الشموخ", phone: "966555705709" },
        { name: "شركة خزاما لخدمات الاعاشة شركة شخص واحد", phone: "966555504344" },
        { name: "شركة ماهر عايض القرشي وشركاه ذات توصية بسيطة", phone: "966555554997" },
        { name: "مطبخ الباني للإعاشة", phone: "966565654007" },
        { name: "المطبخ الأول", phone: "966564557996" },
        { name: "مطبخ العمدة للاعاشة", phone: "966551554613" },
        { name: "شركة اصول العالمية لخدمات الاعاشة", phone: "966555536887" },
        { name: "مطبخ الهجرة", phone: "966508833236" },
        { name: "مطبخ سنام الجود", phone: "966555868637" },
        { name: "مطبخ ام الغوالي سكينة", phone: "966500672954" },
        { name: "مؤسسة الوسام المدني لخدمات الإعاشة", phone: "966598787401" },
        { name: "شركة سفرة الكرم لتقديم الاعاشة", phone: "966501346770" },
        { name: "فن الساتي", phone: "966542326297" },
        { name: "مطبخ المركب العربي لتقديم الوجبات", phone: "966505600632" },
        { name: "مطبخ رتاج الصفوة لتقديم الوجبات", phone: "966534660071" },
        { name: "شركة مطابخ أضياف المشاعر لتقديم الوجبات", phone: "966540845054" },
        { name: "مطابخ الأبراج", phone: "966555911291" },
        { name: "مطاعم ومطابخ ديوان الدانة", phone: "966555686979" },
        { name: "مطبخ التخصصي للاعاشة والتغذية", phone: "966555579031" },
        { name: "مؤسسة سمد لخدمات الإعاشة والتموين", phone: "966555140820" },
        { name: "مطابخ برهان الهدي للاعاشه", phone: "966540238401" },
        { name: "الفريج لخدمات الاعاشة", phone: "966505268777" },
        { name: "مطبخ الرفاع الماسي", phone: "966555510102" },
        { name: "مأدبة الشرق", phone: "966555500350" },
        {
          name: "مطبخ الوفاء لاعداد وتجهيز الوجبات الغذائية وتموين والاعاشة",
          phone: "966555515599",
        },
        { name: "مطبخ ارياف الجودة الذهبية لتقديم الوجبات", phone: "966555573131" },
        { name: "مطبخ الجائزة", phone: "966555517437" },
        { name: "مطابخ قصر سرايا", phone: "966552865597" },
        { name: "الراضي للإعاشة والحفلات", phone: "966555836237" },
        { name: "شركة المسافرون لخدمات الاعاشة", phone: "966555520405" },
        { name: "مطبخ زاد الوفود", phone: "966530885289" },
        { name: "شركة قطرات ندى المحدودة", phone: "966557771215" },
        { name: "مطبخ راوي", phone: "966555506135" },
        { name: "مؤسسة الصرح المطور للاعاشة والتغذية", phone: "966558808687" },
        { name: "مؤسسة المأدبة الماسية لخدمات الاعاشة", phone: "966545541888" },
        { name: "شركة تالة النخيل لتقديم الوجبات", phone: "966544829660" },
        { name: "السمو للاعاشة", phone: "966501787674" },
        { name: "ركايا لخدمات الاعاشة", phone: "966568700108" },
        { name: "مؤسسة بصمة الطهاة لخدمات الاعاشة", phone: "966534761823" },
        { name: "جود التميز لخدمات الاعاشة", phone: "966503525886" },
        { name: "شركة رفاهية الغربية لخدمات الاعاشة", phone: "966541262830" },
        { name: "مطبخ ضيوف المشاعر", phone: "966567360294" },
        { name: "شركة النادل الذهبي لخدمات الاعاشة", phone: "966550000728" },
        { name: "الشركاء المتحدة للإعاشة", phone: "966545911307" },
        { name: "شركة الباز العربية لخدمات الاعاشة", phone: "966555590114" },
        { name: "مؤسسة حراء عالمي لخدمات الاعاشة", phone: "966555066337" },
        { name: "مؤسسة الدار البيضاء لخدمات الإعاشة", phone: "966508813181" },
        { name: "شركة عبير لخدمات الإعاشة", phone: "966555953367" },
        { name: "شركة الجونة المتميزة للحلويات و الحفلات", phone: "966593389933" },
        { name: "شركة حلوى الكافي لخدمات الاعاشة", phone: "966565445454" },
        { name: "مؤسسة رواسي الحجازية", phone: "966565544331" },
        { name: "القمه لخدمات الاعاشه والتموين", phone: "966594256736" },
        { name: "مؤسسة دليل المشاعر لخدمات الاعاشة", phone: "966553529555" },
        { name: "مطبخ الشيف العام لخدمات الإعاشة", phone: "966500100206" },
        { name: "مطبخ ومطعم لو بارد لتقديم الوجبات", phone: "966555532020" },
        { name: "شركه نكهه القصر المحدوده", phone: "966561291212" },
        { name: "خجل لخدمات الاعاشة", phone: "966595474502" },
        { name: "مطبخ القاصدين لتقديم الوجبات", phone: "966500958613" },
        { name: "كيان الهدى لخدمات الاعاشة", phone: "966560051322" },
        { name: "مؤسسة داود عادل بن محمد فطاني لخدمات الاعاشة", phone: "966533116317" },
        { name: "مطبخ مذاق الهدهد لتقديم الوجبات", phone: "966507509803" },
        { name: "مطبخ نزهة المشتاقين لتقديم الوجبات", phone: "966557534802" },
        { name: "شركة سبل المتحدة لخدمات الاعاشة", phone: "966555503940" },
        { name: "شركة براق المسك لخدمات الاعاشه", phone: "966555986867" },
        { name: "قافلة الغذاء لخدمات الاعاشة", phone: "966597896656" },
        { name: "مطابخ مايس المتميزة لتقديم الوجبات", phone: "966555573667" },
        { name: "مطبخ تحديث و ابتكار لخدمات الاعاشة", phone: "966504403057" },
        { name: "شركة الإسناد الذهبي للتجارة شركة شخص واحد", phone: "966553331099" },
        { name: "شركة اذواق الخير لخدمات الاعاشة", phone: "966566299243" },
        { name: "شركة زاد العز لخدمات الإعاشة", phone: "966555555221" },
        { name: "البيان الماسي لخدمات الاعاشة والتموين", phone: "966504770203" },
        { name: "مطبخ المختار للاعاشة والتموين", phone: "966569956313" },
        { name: "مطبخ نور الهداء لتقديم الوجبات", phone: "966555512815" },
        { name: "مؤسسة الرأي المناسب لخدمات الإعاشة", phone: "966556550738" },
        { name: "شركة الال المتحدة لخدمات الاعاشة", phone: "966550883399" },
        { name: "مطبخ درة المشاعر", phone: "966554732484" },
        { name: "شركة إسناد المشاعر لخدمات الاعاشة", phone: "966566110821" },
        { name: "مطبخ مكي لخدمات الاعاشة", phone: "966555642138" },
        { name: "شركة مذاق المساء المحدودة", phone: "966505556242" },
        { name: "مطبخ راحل", phone: "966565277267" },
        { name: "معمل شركة الرومانسية", phone: "966533613366" },
        { name: "مؤسسة رمزى مسعود مفرح العميري لخدمات الإعاشة", phone: "966545710040" },
        { name: "مطبخ الدمنهوري لخدمات الاعاشة", phone: "966507072272" },
        { name: "شركة مكي للإعاشة", phone: "966599069632" },
        { name: "مطاعم ومطابخ الرنة المتميزة لخدمات الإعاشة", phone: "966568099664" },
        { name: "شركة والمة لخدمات الاعاشة", phone: "966555882257" },
        { name: "شركة الجزر لخدمات الاعاشة", phone: "966555502368" },
        { name: "مطبخ صفوة النعم لخدمات الاعاشة", phone: "966544744344" },
        { name: "مؤسسة الريادة المتميزة لخدمات الاعاشة", phone: "966565638236" },
        { name: "شركة زادنا المساندة لخدمات الاعاشة", phone: "966558992282" },
        { name: "مطبخ رفادة الضيف لتقديم الوجبات", phone: "966552557764" },
        { name: "شركة أزواد رواد الغذاء", phone: "966501623502" },
        { name: "مؤسسة ذكرى مشرع بن ماشع الروقي لخدمات الاعاشة", phone: "966561197005" },
        { name: "عشية الخير لخدمات الإعاشة", phone: "966559347675" },
        { name: "مطبخ علي الجبلي", phone: "966555931847" },
        { name: "كنان العربية", phone: "966541419412" },
        { name: "مطبخ انوار الكوثر", phone: "966557111184" },
        { name: "مطبخ التوحيد", phone: "966566066864" },
        { name: "شركة التيسير الماسي لخدمات الأعاشة", phone: "966541474262" },
        { name: "مطبخ فوزي عباس أبو رزيزة", phone: "966533578855" },
        { name: "زاد التميز الفرع الثاني", phone: "966555597934" },
        { name: "مؤسسة حلا السلطانة لخدمات الاعاشة", phone: "966559355535" },
        { name: "شركة الماك لخدمات الاعاشة", phone: "966545562641" },
        { name: "مؤسسة سفير الطهاة لخدمات الاعاشة", phone: "966530447236" },
        { name: "شركة زي لخدمات الإعاشة", phone: "966596057609" },
        { name: "مطابخ الولائم العربية", phone: "966590985318" },
        { name: "شركة اصالة الناصر لخدمات الاعاشة", phone: "966555547488" },
        { name: "مطبخ بركة رائد لخدمات الإعاشة", phone: "966504510121" },
        { name: "مطبخ مسك الاعاشة لتقديم الوجبات", phone: "966500324777" },
        { name: "شركة الطهاة الخمسة لخدمات الاعاشة", phone: "" },
        { name: "مطبخ أقوات المتحدة الخدمات الاعاشة", phone: "966531382194" },
        { name: "شركة إكرام لخدمات الاعاشة", phone: "966537126072" },
        { name: "مطبخ منار طيبة لخدمات الاعاشة والتموين", phone: "966552557764" },
        { name: "حفاوة للإعاشة والتموين", phone: "966563237482" },
        { name: "شركة الحجاز المتحدة لخدمات الاعاشة", phone: "966591460130" },
        { name: "شركة العهد الحديث لخدمات الإعاشة", phone: "966505521080" },
        { name: "مؤسسة أذواق الرواد لخدمات الاعاشة", phone: "966549844130" },
        { name: "مطابخ اسناد الحاج", phone: "506632009" },
        { name: "مؤسسة وائل فوزي بن اسماعيل ميره لخدمات الاعاشة", phone: "966564168866" },
        { name: "مطبخ راحل", phone: "" },
        { name: "مطبخ مذاق اوتاد لتقديم الوجبات", phone: "966500420295" },
        { name: "مطبخ الكرم البدوي لخدمات الاعاشة", phone: "966553320304" },
        { name: "مطابخ الضياء", phone: "966555514725" },
        { name: "اساس الخليج لخدمات الاعاشة", phone: "966533911076" },
        { name: "شركة ذوق لخدمات الاعاشة", phone: "966554270878" },
        { name: "قمة المشاعر لخدمات الاعاشة", phone: "966556500254" },
        { name: "ضيافة المعروف لخدمات االعاشة", phone: "" },
        { name: "شركة زاد العماد المحدودة", phone: "966563395066" },
        { name: "شركة الضيافة الجوهرية لخدمات الاعاشة", phone: "966555985587" },
        { name: "مؤسسة القرية الفضية المتحدة لخدمات الاعاشة", phone: "966575760313" },
        { name: "مطبخ إمداد المشاعر لخدمات الاعاشة", phone: "966533818299" },
        { name: "مؤسسة أكارم البيت لخدمات الاعاشة", phone: "966565563330" },
        { name: "مطبخ الجونة للاعاشة", phone: "966563255339" },
        { name: "شركة الروابط للإعاشة", phone: "966508133260" },
        { name: "بيت الثريد لخدمات الاعاشة", phone: "966563866664" },
        { name: "مطبخ اصالة الصفوة لتقديم الوجبات", phone: "966504592969" },
        { name: "شركة السفرة الحجازية لخدمات الاعاشة", phone: "966590001207" },
        {
          name: "شركة رغيد عدنان بن عبدالشكور بشناق لتقديم الوجبات",
          phone: "966500600202",
        },
        { name: "مؤسسة شعاع السنبلة لخدمات الاعاشة", phone: "966509509600" },
        { name: "مطابخ مدى الضيافه لتقديم الوجبات", phone: "966564608585" },
        { name: "شركة دلفين لخدمات الاعاشة", phone: "966505676401" },
        { name: "شركة مناف الغذاء الصناعية", phone: "966506696996" },
        { name: "شركة الفخامة الماسية لخدمات الاعاشة", phone: "966555515224" },
        { name: "مطبخ وردة الريحان للإعاشة", phone: "966536213219" },
        { name: "المبتكرون المتحدة للاعاشة", phone: "966542040808" },
        { name: "شركة مسارات المشاعر لخدمات الاعاشة", phone: "966595555754" },
        { name: "مطبخ ممتاز المشهور لتقديم الوجبات", phone: "966555525275" },
        { name: "شركة الجونة المتميزة للحلويات والحفلات", phone: "966566617453" },
        { name: "اثير الشموخ لخدمات الاعاشة", phone: "966560740080" },
        { name: "مطبخ الابرار المتحدة للإعاشة", phone: "966590718206" },
        { name: "مطبخ المذاق التركي لخدمات الاعاشة", phone: "966555510370" },
        { name: "مؤسسة روابي الحجاز للتموين", phone: "966595057037" },
        { name: "شركة مذاق النبلاء لخدمات الاعاشة", phone: "" },
        { name: "شركة الثمرات لخدمات الاعاشة", phone: "966555888934" },
        { name: "شركه روائع الضيافة", phone: "966565559050" },
        { name: "شركة الضيافة العربية لخدمات الاعاشة", phone: "966563747474" },
        { name: "شركة خدمات الراية الفندقية", phone: "966565859507" },
        { name: "مؤسسة الامداد والتموين السعودي لخدمات الاعاشة", phone: "" },
        { name: "مطابخ روافد حجازية", phone: "966568015399" },
        { name: "شركة الجونة المتميزة للحلويات والحفلات", phone: "" },
        { name: "مؤسسة سامي منصور دمنهوري التجارية", phone: "966555523851" },
        { name: "شركة خطوط المشاعر لخدمات الاعاشة شركة شخص واحد", phone: "966504540646" },
        { name: "مطبخ اشرقت الماسي لخدمات الاعاشة", phone: "966566643562" },
        { name: "شركة الطهاة الخمسة لخدمات الاعاشة 2", phone: "" },
        { name: "شركة كيان الجود لتقديم الوجبات", phone: "966555561217" },
        { name: "مؤسسة زاد آسيا لخدمات الاعاشة", phone: "966555543370" },
        { name: "مؤسسة بهارات اسيا لخدمات الاعاشة", phone: "966567259989" },
        { name: "التفيذ الذكي لخدمات الاعاشة", phone: "966501407454" },
        { name: "مطبخ خيرات الموسم لتقديم الوجبات", phone: "966552865597" },
        { name: "شركة الثمرات لخدمات الاعاشة", phone: "" },
        { name: "شركة بيت القريات لتقديم الوجبات الخفيفة", phone: "" },
        { name: "شركة رباعيات الشيف لخدمات الاعاشة", phone: "966501200044" },
      ],
    };
  },
  computed: {
    sortOptions() {
      // Create an options list from our fields
      return this.fields
        .filter((f) => f.sortable)
        .map((f) => {
          return { text: f.label, value: f.key };
        });
    },
  },
  mounted() {
    // Set the initial number of items
    this.totalRows = this.customers.length;
  },
  created: function () {
    this.$eventBus.$on("customersSaved", (message) => {
      this.showMessage("success", message);
      this.getCustomers();
      this.create_new = null;
    });
    // this.getCustomers();
  },
  methods: {
    addFilter() {
      this.customers = [];
      this.totalRows = 1;
      this.currentPage = 1;
      this.offset = 0;
      //   this.getCustomers();
    },
    getCustomers() {
      let vm = this;
      this.isLoading = true;
      axios
        .get(this.$apiUrl + "/customers")
        .then((response) => {
          this.isLoading = false;
          vm.isLoading = false;

          this.customers = response.data.data;

          this.totalRows = response.data.total;
        })
        .catch((error) => {
          vm.isLoading = false;
          if (error.request?.statusText) {
            this.showError(error.request?.statusText);
          } else if (error.message) {
            this.showError(error.message);
          } else {
            this.showError(__("something_went_wrong"));
          }
        });
    },
    updateStatusCustomer(index, id) {
      this.$swal
        .fire({
          title: "Are you Sure?",
          text: "You want to change status.",
          confirmButtonText: "Yes, Sure",
          cancelButtonText: "Cancel",
          icon: "warning",
          showCancelButton: true,
          confirmButtonColor: "#37a279",
          cancelButtonColor: "#d33",
        })
        .then((result) => {
          if (result.value) {
            this.isLoading = true;
            let postData = {
              id: id,
            };
            axios.post(this.$apiUrl + "/customers/change", postData).then((response) => {
              this.isLoading = false;
              this.getCustomers();
              this.showMessage("success", response.data.message);
            });
          }
        });
    },
  },
};
</script>
